#### Terraform Plan 📖

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_resource_group.main will be destroyed
  # (because azurerm_resource_group.main is not in configuration)
  - resource "azurerm_resource_group" "main" {
      - id       = "/subscriptions/8be2f576-d66d-49f4-94ee-62d03f0dd825/resourceGroups/rg-infrastructure" -> null
      - location = "southindia" -> null
      - name     = "rg-infrastructure" -> null
      - tags     = {
          - "Environment" = "Dev"
          - "ManagedBy"   = "Terraform"
          - "Service"     = "terraform-managed"
        } -> null
    }

  # module.azure_sql.azurerm_mssql_database.main must be replaced
-/+ resource "azurerm_mssql_database" "main" {
      ~ auto_pause_delay_in_minutes                                = 0 -> (known after apply)
      ~ collation                                                  = "SQL_Latin1_General_CP1_CI_AS" -> (known after apply)
      + creation_source_database_id                                = (known after apply)
      + enclave_type                                               = (known after apply)
      ~ id                                                         = "/subscriptions/8be2f576-d66d-49f4-94ee-62d03f0dd825/resourceGroups/rg-infrastructure/providers/Microsoft.Sql/servers/sqlserver020rojwk/databases/sqldatabase" -> (known after apply)
      ~ ledger_enabled                                             = false -> (known after apply)
      + license_type                                               = (known after apply)
      ~ maintenance_configuration_name                             = "SQL_Default" -> (known after apply)
      ~ max_size_gb                                                = 10 -> (known after apply)
      ~ min_capacity                                               = 0 -> (known after apply)
      ~ name                                                       = "sqldatabase" -> "sqldb-020rojwk" # forces replacement
      ~ read_replica_count                                         = 0 -> (known after apply)
      ~ read_scale                                                 = false -> (known after apply)
      + restore_point_in_time                                      = (known after apply)
      + sample_name                                                = (known after apply)
      + secondary_type                                             = (known after apply)
      ~ server_id                                                  = "/subscriptions/8be2f576-d66d-49f4-94ee-62d03f0dd825/resourceGroups/rg-infrastructure/providers/Microsoft.Sql/servers/sqlserver020rojwk" # forces replacement -> (known after apply) # forces replacement
      ~ sku_name                                                   = "S0" -> "Basic"
        tags                                                       = {
            "Environment" = "Dev"
            "ManagedBy"   = "Terraform"
            "Service"     = "terraform-managed"
        }
      ~ zone_redundant                                             = false -> (known after apply)
        # (5 unchanged attributes hidden)

      - long_term_retention_policy {
          - immutable_backups_enabled = false -> null
          - monthly_retention         = "PT0S" -> null
          - week_of_year              = 1 -> null
          - weekly_retention          = "PT0S" -> null
          - yearly_retention          = "PT0S" -> null
        }

      - short_term_retention_policy {
          - backup_interval_in_hours = 24 -> null
          - retention_days           = 7 -> null
        }

      - threat_detection_policy {
          - disabled_alerts      = [] -> null
          - email_account_admins = "Disabled" -> null
          - email_addresses      = [] -> null
          - retention_days       = 0 -> null
          - state                = "Disabled" -> null
        }
    }

  # module.azure_sql.azurerm_mssql_firewall_rule.allow_azure_services will be destroyed
  # (because azurerm_mssql_firewall_rule.allow_azure_services is not in configuration)
  - resource "azurerm_mssql_firewall_rule" "allow_azure_services" {
      - end_ip_address   = "0.0.0.0" -> null
      - id               = "/subscriptions/8be2f576-d66d-49f4-94ee-62d03f0dd825/resourceGroups/rg-infrastructure/providers/Microsoft.Sql/servers/sqlserver020rojwk/firewallRules/allow-azure-services" -> null
      - name             = "allow-azure-services" -> null
      - server_id        = "/subscriptions/8be2f576-d66d-49f4-94ee-62d03f0dd825/resourceGroups/rg-infrastructure/providers/Microsoft.Sql/servers/sqlserver020rojwk" -> null
      - start_ip_address = "0.0.0.0" -> null
    }

  # module.azure_sql.azurerm_mssql_firewall_rule.allow_ip will be destroyed
  # (because azurerm_mssql_firewall_rule.allow_ip is not in configuration)
  - resource "azurerm_mssql_firewall_rule" "allow_ip" {
      - end_ip_address   = "89.27.102.166" -> null
      - id               = "/subscriptions/8be2f576-d66d-49f4-94ee-62d03f0dd825/resourceGroups/rg-infrastructure/providers/Microsoft.Sql/servers/sqlserver020rojwk/firewallRules/allow-specific-ip" -> null
      - name             = "allow-specific-ip" -> null
      - server_id        = "/subscriptions/8be2f576-d66d-49f4-94ee-62d03f0dd825/resourceGroups/rg-infrastructure/providers/Microsoft.Sql/servers/sqlserver020rojwk" -> null
      - start_ip_address = "89.27.102.166" -> null
    }

  # module.azure_sql.azurerm_mssql_firewall_rule.allow_specific_ip will be created
  + resource "azurerm_mssql_firewall_rule" "allow_specific_ip" {
      + end_ip_address   = "129.41.46.1"
      + id               = (known after apply)
      + name             = "AllowSpecificIP"
      + server_id        = (known after apply)
      + start_ip_address = "129.41.46.1"
    }

  # module.azure_sql.azurerm_mssql_server.main must be replaced
-/+ resource "azurerm_mssql_server" "main" {
      ~ administrator_login_password             = (sensitive value)
      - administrator_login_password_wo_version  = 0 -> null
      ~ fully_qualified_domain_name              = "sqlserver020rojwk.database.windows.net" -> (known after apply)
      ~ id                                       = "/subscriptions/8be2f576-d66d-49f4-94ee-62d03f0dd825/resourceGroups/rg-infrastructure/providers/Microsoft.Sql/servers/sqlserver020rojwk" -> (known after apply)
      ~ name                                     = "sqlserver020rojwk" -> "mssqlserver020rojwk" # forces replacement
      + primary_user_assigned_identity_id        = (known after apply)
      ~ restorable_dropped_database_ids          = [] -> (known after apply)
        tags                                     = {
            "Environment" = "Dev"
            "ManagedBy"   = "Terraform"
            "Service"     = "terraform-managed"
        }
        # (9 unchanged attributes hidden)
    }

  # module.azure_sql.azurerm_resource_group.main will be created
  + resource "azurerm_resource_group" "main" {
      + id       = (known after apply)
      + location = "southindia"
      + name     = "rg-infrastructure"
      + tags     = {
          + "Environment" = "Dev"
          + "ManagedBy"   = "Terraform"
          + "Service"     = "terraform-managed"
        }
    }

  # module.azure_sql.random_password.admin_password will be created
  + resource "random_password" "admin_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.azure_sql.random_password.sql_admin_password will be destroyed
  # (because random_password.sql_admin_password is not in configuration)
  - resource "random_password" "sql_admin_password" {
      - bcrypt_hash = (sensitive value) -> null
      - id          = "none" -> null
      - length      = 16 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = (sensitive value) -> null
      - special     = true -> null
      - upper       = true -> null
    }

Plan: 5 to add, 0 to change, 6 to destroy.

Changes to Outputs:
  ~ sql_database_id = "/subscriptions/8be2f576-d66d-49f4-94ee-62d03f0dd825/resourceGroups/rg-infrastructure/providers/Microsoft.Sql/servers/sqlserver020rojwk/databases/sqldatabase" -> (known after apply)
  - sql_server_fqdn = "sqlserver020rojwk.database.windows.net" -> null
  ~ sql_server_id   = "/subscriptions/8be2f576-d66d-49f4-94ee-62d03f0dd825/resourceGroups/rg-infrastructure/providers/Microsoft.Sql/servers/sqlserver020rojwk" -> (known after apply)

```

</details>

*Plan generated at: 2026-02-25T11:50:24.862Z*